app/controllers/books_controller.rb

  def index
    @books = Book.where(:user_id => current_user)
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = 2

  def create
    @book = Book.new(params[:book])
    @book.user_id = current_user.id
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)