app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."user_id" = 1
---
  def index
    @movies = Movie.where(:user_id => current_user)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("actors", "created_at", "description", "director", "genre", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Move.new(params[:movie])
    @movie.user = current_user.id
    respond_to do |format|
      if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "movies" SET "image_updated_at" = '2012-11-26 19:48:04.677391', "updated_at" = '2012-11-26 19:48:04.866584' WHERE "movies"."id" = 9
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])