app/controllers/musics_controller.rb

SELECT "musics".* FROM "musics" WHERE "musics"."user_id" = 2
---
  def index
    @musics = Music.where(:user_id => current_user)

SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @music = Music.find(params[:id])

INSERT INTO "musics" ("album", "artist", "comments", "created_at", "favorite_song", "genre", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @music = Music.new(params[:music])
    @music.user_id = current_user.id
    respond_to do |format|
      if @music.save

SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]
---
  def destroy
    @music = Music.find(params[:id])
    @music.destroy